# GetCoordinate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine..::..GetCoordinate Method
PolyLine Class See Also
---
Gets the coordinate point of the specified index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ GetCoordinate(
	int index
)
```

Visual Basic
---
```text
Public Function GetCoordinate ( _
	index As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetCoordinate(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32The index of the coordinates.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the index value is out of range. |

# See Also
PolyLine Class
Autodesk.Revit.DB Namespace